In [5]:
import pandas as pd

In [6]:
s1 = pd.Series([50,60,70,80])

In [7]:
s1

0    50
1    60
2    70
3    80
dtype: int64

In [8]:
s1[2]

70

In [9]:
s2 = pd.Series([50,60,70,80],index = ['a','b','c','d'])

In [10]:
s2

a    50
b    60
c    70
d    80
dtype: int64

In [11]:
s2['c']

70

In [12]:
s2[2]

70

In [13]:
import numpy as np
from numpy import random as rd

In [14]:
df1 = pd.DataFrame(np.random.randint(10,50,[5,4]) )

In [15]:
df1

    0   1   2   3
0  39  34  13  16
1  25  31  45  27
2  47  40  44  20
3  19  38  10  39
4  17  11  13  26

In [16]:
df1 = pd.DataFrame(np.random.randint(10,50,[5,4]),
                  index = 'a b c d e'.split(),
                  columns = list('W X Y Z'.split));

TypeError: 'builtin_function_or_method' object is not iterable

In [66]:
df1.Y

AttributeError: 'DataFrame' object has no attribute 'Y'

In [26]:
df1.W

a    32
b    10
c    23
d    21
e    46
Name: W, dtype: int32

In [27]:
df1['X']

a    35
b    28
c    20
d    27
e    17
Name: X, dtype: int32

In [28]:
df1['X']['e']

17

In [30]:
df1

    W   X   Y   Z
a  32  35  11  23
b  10  28  21  31
c  23  20  35  31
d  21  27  46  14
e  46  17  17  46

In [31]:
df1['Z']['a']

23

In [32]:
df1.loc['a']

W    32
X    35
Y    11
Z    23
Name: a, dtype: int32

In [33]:
df1.loc['a']['X']

35

In [34]:
df1.iloc[0][1]

35

In [36]:
df1.iloc[0][3]

23

In [37]:
df1[['Y','Z']]

    Y   Z
a  11  23
b  21  31
c  35  31
d  46  14
e  17  46

In [38]:
df1.loc[['a','b']]

    W   X   Y   Z
a  32  35  11  23
b  10  28  21  31

In [39]:
df1

    W   X   Y   Z
a  32  35  11  23
b  10  28  21  31
c  23  20  35  31
d  21  27  46  14
e  46  17  17  46

In [40]:
df1.loc['b','X']

28

In [45]:
df1.loc['c':'e',['Y','Z']]

    Y   Z
c  35  31
d  46  14
e  17  46

In [43]:
df1.loc[:,'W':'Y']

    W   X   Y
a  32  35  11
b  10  28  21
c  23  20  35
d  21  27  46
e  46  17  17

In [46]:
df1

    W   X   Y   Z
a  32  35  11  23
b  10  28  21  31
c  23  20  35  31
d  21  27  46  14
e  46  17  17  46

In [47]:
df1>20

       W      X      Y      Z
a   True   True  False   True
b  False   True   True   True
c   True  False   True   True
d   True   True   True  False
e   True  False  False   True

In [48]:
df1[df1>20]

      W     X     Y     Z
a  32.0  35.0   NaN  23.0
b   NaN  28.0  21.0  31.0
c  23.0   NaN  35.0  31.0
d  21.0  27.0  46.0   NaN
e  46.0   NaN   NaN  46.0

In [50]:
df1

    W   X   Y   Z
a  32  35  11  23
b  10  28  21  31
c  23  20  35  31
d  21  27  46  14
e  46  17  17  46

In [56]:
df1['W']>20

a     True
b    False
c     True
d     True
e     True
Name: W, dtype: bool

In [54]:
df1[df1['W']>20]

    W   X   Y   Z
a  32  35  11  23
c  23  20  35  31
d  21  27  46  14
e  46  17  17  46

In [70]:
df1

    0   1   2   3
0  35  20  47  37
1  41  44  46  47
2  34  36  12  35
3  20  16  20  15
4  18  16  15  45

In [76]:
data = {
    'Company' :['SCG','SCG','PTT','PTT','KTB','KTB'],
    'Person' :list("ABCDEF"),
    'Sales' : [200,300,450,100,140,350]
}

In [77]:
df = pd.DataFrame(data)
df

  Company Person  Sales
0     SCG      A    200
1     SCG      B    300
2     PTT      C    450
3     PTT      D    100
4     KTB      E    140
5     KTB      F    350

In [78]:
df.groupby('Company')

In [79]:
df.groupby('Company').sum()

        Person  Sales
Company
KTB         EF    490
PTT         CD    550
SCG         AB    500

In [83]:
df.groupby('Company').sum()['Sales']

Company
KTB    490
PTT    550
SCG    500
Name: Sales, dtype: int64

In [84]:
df.groupby('Company').sum().loc['PTT']

Person     CD
Sales     550
Name: PTT, dtype: object

In [85]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
KTB       2.0  245.0  148.492424  140.0  192.5  245.0  297.5  350.0
PTT       2.0  275.0  247.487373  100.0  187.5  275.0  362.5  450.0
SCG       2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0

In [86]:
df.groupby('Company').describe().transpose()

Company             KTB         PTT         SCG
Sales count    2.000000    2.000000    2.000000
      mean   245.000000  275.000000  250.000000
      std    148.492424  247.487373   70.710678
      min    140.000000  100.000000  200.000000
      25%    192.500000  187.500000  225.000000
      50%    245.000000  275.000000  250.000000
      75%    297.500000  362.500000  275.000000
      max    350.000000  450.000000  300.000000

In [87]:
df['Company'].unique()

array(['SCG', 'PTT', 'KTB'], dtype=object)

In [88]:
df['Company'].nunique()

3

In [89]:
df['Company'].value_counts()

Company
SCG    2
PTT    2
KTB    2
Name: count, dtype: int64

In [90]:
df[df['Sales']== 200]

  Company Person  Sales
0     SCG      A    200

In [92]:
df

  Company Person  Sales
0     SCG      A    200
1     SCG      B    300
2     PTT      C    450
3     PTT      D    100
4     KTB      E    140
5     KTB      F    350

In [93]:
df['Sales'].max()

450

In [94]:
df[df['Sales'] == df['Sales'].max()]

  Company Person  Sales
2     PTT      C    450

In [8]:
fn1 = lambda x : x*2

In [9]:
df['Sales'].apply(fn1)

NameError: name 'df' is not defined

In [16]:
df = pd.read_excel('Sample - Superstore.xls')

In [17]:
df

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2016-152156,2016-11-08,2016-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2016-138688,2016-06-12,2016-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2015-108966,2015-10-11,2015-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,9990,CA-2014-110422,2014-01-21,2014-01-23,Second Class,TB-21400,Tom Boeckenhauer,Consumer,United States,Miami,...,33180,South,FUR-FU-10001889,Furniture,Furnishings,Ultra Door Pull Handle,25.2480,3,0.20,4.1028
9990,9991,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,FUR-FU-10000747,Furniture,Furnishings,Tenex B1-RE Series Chair Mats for Low Pile Car...,91.9600,2,0.00,15.6332
9991,9992,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,TEC-PH-10003645,Technology,Phones,Aastra 57i VoIP phone,258.5760,2,0.20,19.3932
9992,9993,CA-2017-121258,2017-02-26,2017-03-03,Standard Class,DB-13060,Dave Brooks,Consumer,United States,Costa Mesa,...,92627,West,OFF-PA-10004041,Office Supplies,Paper,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",29.6000,4,0.00,13.3200
9993,9994,CA-2017-119914,2017-05-04,2017-05-09,Second Class,CC-12220,Chris Cortes,Consumer,United States,Westminster,...,92683,West,OFF-AP-10002684,Office Supplies,Appliances,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",243.1600,2,0.00,72.9480

In [18]:
df.groupby('Customer Name')['Profit'].sum().max()

8981.3239